emacs/.emacs.d/settings.org
#+TITLE: EMACS General Configuration File
#+AUTHOR: Felippe Alves

* Basic User Interface
** Set UTF-8 as default encodins
#+BEGIN_SRC emacs-lisp
(set-language-environment "UTF-8")
(set-default-coding-systems 'utf-8)
#+END_SRC

** Package Manager
#+BEGIN_SRC emacs-lisp
(require 'package)
(add-to-list 'package-archives
             '("melpa" . "https://melpa.org/packages/"))
(when (< emacs-major-version 24)
  ;; For important compatibility libraries like cl-lib
  (add-to-list 'package-archives '("gnu" . "http://elpa.gnu.org/packages/")))
(package-initialize)

(unless (package-installed-p 'use-package)
  (progn
    (package-refresh-contents)
    (package-install 'use-package)))
(eval-when-compile
  (require 'use-package))
(require 'diminish)
(require 'bind-key)
#+END_SRC

*** Paradox
 modern package manager for emacs
#+BEGIN_SRC emacs-lisp 
  (use-package paradox
    :ensure t
    :commands paradox-list-packages
    :config
    (setq paradox-github-token t
          paradox-automatically-star nil
          paradox-execute-asynchronously nil))
#+END_SRC

** Emacs Gui Behavior
#+BEGIN_SRC emacs-lisp
  (setq inhibit-startup-screen t       ;; don't show startup screen
        visible-bell nil               ;; no visual bell
        apropos-do-all t               ;; more options on aproppos search (C-h a)
        shift-select-mode nil)         ;; no region selecting with shift arrows

  (fset 'yes-or-no-p 'y-or-n-p)        ;; use y/n instead of yes/no
  (defalias 'list-buffers 'ibuffer)    ;; use ibuffer as default buffer list (C-x C-b)

  (menu-bar-mode 1)                   ;; ~no~ menu bar
  (tool-bar-mode -1)                   ;; no tool bar
  (scroll-bar-mode -1)                 ;; no scroll bar
  (blink-cursor-mode -1)               ;; no cursor blinking
  (fringe-mode '(10 . 1))              ;; 10 pixel window fringes
  (toggle-indicate-empty-lines t)      ;; display dashes on left border end of buffer
;;  (highlight-indentation-mode -1)     ;; do not highlight indentation

  (setq-default indent-tabs-mode nil)  ;; never use hard tabs

  (setq show-paren-delay 0)            ;; immediatly show matching delimiter
  (show-paren-mode t)                  ;; turn of highlighting of matching delimiters

  (column-number-mode 1)               ;; show column number in mode line
  (setq-default fill-column 80)        ;; number of characters before line wrap
  (global-visual-line-mode 1)          ;; turn on line wrap on window border
  (diminish 'visual-line-mode "w↩")   ;; diminish the bulky "Wrap"

  (require 'cl)
  ;; function to test fonts installed before setting some as default
  (defun font-candidate (&rest fonts)
    "Return existing font which first match."
    (find-if (lambda (f) (find-font (font-spec :name f))) fonts))

  ;; try to set some fonts as default
  (set-face-attribute 'default nil :font (font-candidate "Hack-14:weight=normal"
                                                         "Droid Sans Mono-14:weight=normal"
                                                         "DejaVu Sans Mono-14:weight=normal"))
  (setq linum-format " %3d ")           ;; linum format to keep line numbers 2 spaces from border and text
  (global-linum-mode 0)                  ;; don't display lateral line numbers
  (global-set-key (kbd "M-n") 'global-linum-mode) ;; toggle lateral line numbers
#+END_SRC

** Bakcup directory
#+BEGIN_SRC emacs-lisp
(setq backup-directory-alist `(("." . "~/.emacs.d/backups")))
(setq backup-by-copying t      ;; backup files are copies of the original
      delete-old-versions t    ;; no point in keeping all backaups
      kept-new-versions 6      ;; but keep some of them
      kept-old-versions 2
      version-control t)       ;; and use version control
#+END_SRC

** Color Theme
I've been using
#+BEGIN_SRC emacs-lisp
  (use-package github-modern-theme
    :ensure t)
  (use-package zenburn-theme
    :ensure t)

  (setq theme-moods '(zenburn
                      github-modern))

  (load-theme (car theme-moods) t)

  (defun toggle-theme-mood ()
    (interactive)
    (disable-theme (car theme-moods))
    (setq theme-moods (reverse theme-moods))
    (load-theme (car theme-moods) t))
#+END_SRC

** Mode Line
For now I use spacemacsline
*** Smart-mode-line
a smarter mode line
#+BEGIN_SRC emacs-lisp :tangle no
(use-package smart-mode-line
  :ensure t
  :defer 0.2
  :init
  (progn
    (setq sml/no-confirm-load-theme t
          sml/theme 'respectful
          sml/mode-widht 'full)
    (sml/setup))
  :config
  (setq sml/shorten-directory t
        sml/shorten-modes t))
#+END_SRC

*** Powerline
The simplest thing to do.
#+BEGIN_SRC emacs-lisp :tangle no
(use-package powerline
   :ensure t
   :init (powerline-default-theme))
   ;; :config
   ;; (progn
   ;;   (custom-set-faces
   ;;    '(mode-line-buffer-id ((t (:foreground "#000000" :bold t))))
   ;;    '(which-func ((t (:foreground "#77aaff"))))
   ;;    '(mode-line ((t (:foreground "#000000" :background "#dddddd" :box nil))))
   ;;    '(mode-line-inactive ((t (:foreground "#000000" :background "#bbbbbb" :box nil)))))))
#+END_SRC

*** Amit's mode line
#+BEGIN_SRC emacs-lisp :tangle no
;; Mode line setup
(setq-default
 mode-line-format
 '(; Position, including warning for 80 columns
   (:propertize "%4l:" face mode-line-position-face)
   (:eval (propertize "%3c" 'face
                      (if (>= (current-column) 80)
                          'mode-line-80col-face
                        'mode-line-position-face)))
   ; emacsclient [default -- keep?]
   mode-line-client
   "  "
   ; read-only or modified status
   (:eval
    (cond (buffer-read-only
           (propertize " RO " 'face 'mode-line-read-only-face))
          ((buffer-modified-p)
           (propertize " * " 'face 'mode-line-modified-face))
          (t "      ")))
   "    "
   ; directory and buffer/file name
   (:propertize (:eval (shorten-directory default-directory 30))
                face mode-line-folder-face)
   (:propertize "%b"
                face mode-line-filename-face)
   ; narrow [default -- keep?]
   " %n "
   ; mode indicators: vc, recursive edit, major mode, minor modes, process, global
   (vc-mode vc-mode)
   "  %["
   (:propertize mode-name
                face mode-line-mode-face)
   "%] "
   (:eval (propertize (format-mode-line minor-mode-alist)
                      'face 'mode-line-minor-mode-face))
   (:propertize mode-line-process
                face mode-line-process-face)
   (global-mode-string global-mode-string)
   "    "
   ; nyan-mode uses nyan cat as an alternative to %p
   (:eval (when nyan-mode (list (nyan-create))))
   ))

;; Helper function
(defun shorten-directory (dir max-length)
  "Show up to `max-length' characters of a directory name `dir'."
  (let ((path (reverse (split-string (abbreviate-file-name dir) "/")))
        (output ""))
    (when (and path (equal "" (car path)))
      (setq path (cdr path)))
    (while (and path (< (length output) (- max-length 4)))
      (setq output (concat (car path) "/" output))
      (setq path (cdr path)))
    (when path
      (setq output (concat ".../" output)))
    output))

;; Extra mode line faces
(make-face 'mode-line-read-only-face)
(make-face 'mode-line-modified-face)
(make-face 'mode-line-folder-face)
(make-face 'mode-line-filename-face)
(make-face 'mode-line-position-face)
(make-face 'mode-line-mode-face)
(make-face 'mode-line-minor-mode-face)
(make-face 'mode-line-process-face)
(make-face 'mode-line-80col-face)

(set-face-attribute 'mode-line nil
    :foreground "gray60" :background "gray20"
    :inverse-video nil
    :box '(:line-width 6 :color "gray20" :style nil))
(set-face-attribute 'mode-line-inactive nil
    :foreground "gray80" :background "gray40"
    :inverse-video nil
    :box '(:line-width 6 :color "gray40" :style nil))

(set-face-attribute 'mode-line-read-only-face nil
    :inherit 'mode-line-face
    :foreground "#4271ae"
    :box '(:line-width 2 :color "#4271ae"))
(set-face-attribute 'mode-line-modified-face nil
    :inherit 'mode-line-face
    :foreground "#c82829"
    ;; :background "#ffffff"
    :box '(:line-width 2 :color "#c82829"))
(set-face-attribute 'mode-line-folder-face nil
    :inherit 'mode-line-face
    :foreground "gray60")
(set-face-attribute 'mode-line-filename-face nil
    :inherit 'mode-line-face
    :foreground "#eab700"
    :weight 'bold)
(set-face-attribute 'mode-line-position-face nil
    :inherit 'mode-line-face
    :family "Menlo" :height 100)
(set-face-attribute 'mode-line-mode-face nil
    :inherit 'mode-line-face
    :foreground "gray80")
(set-face-attribute 'mode-line-minor-mode-face nil
    :inherit 'mode-line-mode-face
    :foreground "gray40"
    :height 110)
(set-face-attribute 'mode-line-process-face nil
    :inherit 'mode-line-face
    :foreground "#718c00")
(set-face-attribute 'mode-line-80col-face nil
    :inherit 'mode-line-position-face
    :foreground "black" :background "#eab700")
#+END_SRC

*** Spacemacsline
Spacemacs modeline looks cool and is fairly organized and informative.
#+BEGIN_SRC emacs-lisp
(use-package spaceline
  :ensure t
  :defer 0.2
  :init
  (progn
    (require 'spaceline-config)
    (setq powerline-default-separator 'box))
  :config
  (progn
    (spaceline-emacs-theme)
    (spaceline-helm-mode)))
#+END_SRC

