emacs/.emacs.d/settings.el
(set-language-environment "UTF-8")
(set-default-coding-systems 'utf-8)

(require 'package)
(add-to-list 'package-archives
             '("melpa" . "https://melpa.org/packages/"))
(when (< emacs-major-version 24)
  ;; For important compatibility libraries like cl-lib
  (add-to-list 'package-archives '("gnu" . "http://elpa.gnu.org/packages/")))
(package-initialize)

(unless (package-installed-p 'use-package)
  (progn
    (package-refresh-contents)
    (package-install 'use-package)))
(eval-when-compile
  (require 'use-package))
(require 'diminish)
(require 'bind-key)

(use-package paradox
  :ensure t
  :commands paradox-list-packages
  :config
  (setq paradox-github-token t
        paradox-automatically-star nil
        paradox-execute-asynchronously nil))

(setq inhibit-startup-screen t       ;; don't show startup screen
        visible-bell nil               ;; no visual bell
        apropos-do-all t               ;; more options on aproppos search (C-h a)
        shift-select-mode nil)         ;; no region selecting with shift arrows

  (fset 'yes-or-no-p 'y-or-n-p)        ;; use y/n instead of yes/no
  (defalias 'list-buffers 'ibuffer)    ;; use ibuffer as default buffer list (C-x C-b)

  (menu-bar-mode 1)                   ;; ~no~ menu bar
  (tool-bar-mode -1)                   ;; no tool bar
  (scroll-bar-mode -1)                 ;; no scroll bar
  (blink-cursor-mode -1)               ;; no cursor blinking
  (fringe-mode '(10 . 1))              ;; 10 pixel window fringes
  (toggle-indicate-empty-lines t)      ;; display dashes on left border end of buffer
;;  (highlight-indentation-mode -1)     ;; do not highlight indentation

  (setq-default indent-tabs-mode nil)  ;; never use hard tabs

  (setq show-paren-delay 0)            ;; immediatly show matching delimiter
  (show-paren-mode t)                  ;; turn of highlighting of matching delimiters

  (column-number-mode 1)               ;; show column number in mode line
  (setq-default fill-column 80)        ;; number of characters before line wrap
  (global-visual-line-mode 1)          ;; turn on line wrap on window border
  (diminish 'visual-line-mode "w↩")   ;; diminish the bulky "Wrap"

  (require 'cl)
  ;; function to test fonts installed before setting some as default
  (defun font-candidate (&rest fonts)
    "Return existing font which first match."
    (find-if (lambda (f) (find-font (font-spec :name f))) fonts))

  ;; try to set some fonts as default
  (set-face-attribute 'default nil :font (font-candidate "Hack-14:weight=normal"
                                                         "Droid Sans Mono-14:weight=normal"
                                                         "DejaVu Sans Mono-14:weight=normal"))
  (setq linum-format " %3d ")           ;; linum format to keep line numbers 2 spaces from border and text
  (global-linum-mode 0)                  ;; don't display lateral line numbers
  (global-set-key (kbd "M-n") 'global-linum-mode) ;; toggle lateral line numbers

(setq backup-directory-alist `(("." . "~/.emacs.d/backups")))
(setq backup-by-copying t      ;; backup files are copies of the original
      delete-old-versions t    ;; no point in keeping all backaups
      kept-new-versions 6      ;; but keep some of them
      kept-old-versions 2
      version-control t)       ;; and use version control

(use-package github-modern-theme
  :ensure t)
(use-package zenburn-theme
  :ensure t)

(setq theme-moods '(zenburn
                    github-modern))

(load-theme (car theme-moods) t)

(defun toggle-theme-mood ()
  (interactive)
  (disable-theme (car theme-moods))
  (setq theme-moods (reverse theme-moods))
  (load-theme (car theme-moods) t))

(use-package spaceline
  :ensure t
  :defer 0.2
  :init
  (progn
    (require 'spaceline-config)
    (setq powerline-default-separator 'box))
  :config
  (progn
    (spaceline-emacs-theme)
    (spaceline-helm-mode)))
