emacs/.emacs.d/settings.org
** Helm
I'll try to switch to helm by copying someone else's configuration.
The following was taken from [[https://github.com/sachac/.emacs.d/blob/gh-pages/Sacha.org][Sacha.org]], but I made some modifications suggested in [[http://tuhdo.github.io/helm-intro.html][this helm introduction text]].
<2017-07-03 Mon> Disabled to try ivy for a while.
#+BEGIN_SRC emacs-lisp :tangle no
    (use-package helm
      :ensure t
      :diminish helm-mode
      :init
      (progn
        (require 'helm)
        (require 'helm-config)
        (global-set-key (kbd "C-c h") 'helm-command-prefix)
        (global-unset-key (kbd "C-x c"))
        (define-key helm-map (kbd "<tab>") 'helm-execute-persistent-action)  ;;*
        (define-key helm-map (kbd "C-i") 'helm-execute-persistent-action)    ;;*
        (define-key helm-map (kbd "C-z") 'helm-select-action)    ;;*
        (setq helm-candidate-number-limit 100)
        ;; From https://gist.github.com/antifuchs/9238468
        (setq helm-idle-delay 0.0 ; update fast sources immediately (doesn't).
              helm-input-idle-delay 0.01  ; this actually updates things
                                            ; reeeelatively quickly.
              helm-yas-display-key-on-candidate t
              helm-quick-update t
              helm-M-x-requires-pattern nil
              helm-ff-skip-boring-files t
              helm-split-window-in-side-p t ;;*
              helm-move-to-line-cycle-in-source t ;;*
              helm-ff-search-library-in-sexp t ;;*
              helm-scroll-amount 8 ;;*
              helm-ff-file-name-history-use-recentf t) ;;*
        (helm-mode 1))
      :bind (("M-x" . helm-M-x)
             ("M-y" . helm-show-kill-ring)
             ("C-x b" . helm-mini)
             ("C-x C-f" . helm-find-files)
             ("C-c h /" . helm-find)
             ("C-h a" . helm-apropos)
             ("C-x C-b" . helm-buffers-list)
             ("C-c h o" . helm-occur)
             ("C-c h s" . helm-swoop)
             ("C-c h i" . helm-semantic-or-imenu)
             ("C-c h l" . helm-locate)
             ("C-c h y" . helm-yas-complete)
             ("C-c h Y" . helm-yas-create-snippet-on-region)
             ("C-c h SPC" . helm-all-mark-rings)
             ("C-c h r" . helm-regex)
             ("C-c h x" . helm-register)
             ("C-c h t" . helm-top)
             ("C-c h M-:" . helm-eval-expression-with-eldoc)
             ("C-c h C-," . helm-calcul-expression)
             ("C-c h <tab>" . helm-lisp-completion-at-point)))
  (ido-mode -1) ;; Turn off ido mode in case I enabled it accidentally
#+END_SRC

I won't even change the next assertion, let's come back later to evaluate it.
"Great for describing bindings. I'll replace the binding for =where-is= too."

#+BEGIN_SRC emacs-lisp :tangle no
(use-package helm-descbinds
  :defer t
  :ensure t
  :bind (("C-h b" . helm-descbinds)))
#+END_SRC

** Ivy, Counsel and Swiper
#+BEGIN_SRC emacs-lisp 
  (use-package counsel
    :ensure t)

  (use-package swiper
    :ensure try
    :config
    (progn
      (ivy-mode 1)
      (setq ivy-use-virtual-buffers t)
      (global-set-key (kbd "C-s") 'swiper)
      (global-set-key (kbd "C-c C-r") 'ivy-resume)
      (global-set-key (kbd "<f6>") 'ivy-resume)
      (global-set-key (kbd "M-x") 'counsel-M-x)
      (global-set-key (kbd "C-x C-f") 'counsel-find-file)
      (global-set-key (kbd "<f1> f") 'counsel-describe-function)
      (global-set-key (kbd "<f1> v") 'counsel-describe-variable)
      (global-set-key (kbd "<f1> l") 'counsel-load-library)
      (global-set-key (kbd "<f2> i") 'counsel-info-lookup-symbol)
      (global-set-key (kbd "<f2> u") 'counsel-unicode-char)
      (global-set-key (kbd "C-c g") 'counsel-git)
      (global-set-key (kbd "C-c j") 'counsel-git-grep)
      (global-set-key (kbd "C-c k") 'counsel-ag)
      (global-set-key (kbd "C-x l") 'counsel-locate)
      (global-set-key (kbd "C-S-o") 'counsel-rhythmbox)
      (define-key read-expression-map (kbd "C-r") 'counsel-expression-history)
    ))

  ;; (use-package ivy :ensure t
    ;; :diminish (ivy-mode . "")
    ;; :bind
    ;; (:map ivy-mode-map
     ;; ("C-'" . ivy-avy))
    ;; :config
    ;; (ivy-mode 1))
    ;; add ‘recentf-mode’ and bookmarks to ‘ivy-switch-buffer’.
    ;; (setq ivy-use-virtual-buffers t)
    ;; number of result lines to display
    ;; (setq ivy-height 10))
    ;; does not count candidates
    ;; (setq ivy-count-format "")
    ;; no regexp by default
    ;; (setq ivy-initial-inputs-alist nil)
    ;; configure regexp engine.
    ;; (setq ivy-re-builders-alist
    ;;	;; allow input not in order
    ;     '((t   . ivy--regex-ignore-order))))

  ;; (use-package ivy-hydra
    ;; :ensure t)
#+END_SRC
** Which-key
#+BEGIN_SRC emacs-lisp
(use-package which-key
  :ensure t
  :init (which-key-mode))
#+END_SRC

** Ace-window
   Better window movement
#+BEGIN_SRC emacs-lisp
(use-package ace-window
  :ensure t
  :config
  (progn
    (ace-window-display-mode 0)
    (setq aw-keys '(?a ?s ?d ?f ?z ?x ?c ?v))
    (global-set-key (kbd "M-'") 'ace-window)))
#+END_SRC

** Try
#+BEGIN_SRC emacs-lisp
(use-package try
  :ensure t)
#+END_SRC
** TODO Hydras
Just to have it working
#+BEGIN_SRC emacs-lisp :tangle no
(use-package hydra
  :ensure t
  :config
  (hydra-add-font-lock))
#+END_SRC

** Old Configurations (Not being used)
   This is my ido/smex configuration before switching to helm. I don't remember from where I took it, but I suspect it was from Howard Abrams.
*** Ido
Ido makes suggetions on opening files, buffers and some M-x commnads
#+BEGIN_SRC emacs-lisp :tangle no
(setq ido-enable-flex-matching t
      ido-everywhere t
      ido-create-new-buffer 'always)
(ido-mode 1)
#+END_SRC

this package makes ido works in more contexts
#+BEGIN_SRC emacs-lisp :tangle no
(use-package ido-ubiquitous
  :ensure t
  :disabled t
  :ensure ido
  :config
  (ido-ubiquitous-mode t))
#+END_SRC

*** Smex
makes ido work with more M-x commands
#+BEGIN_SRC emacs-lisp :tangle no
  (use-package smex
    :ensure t
    :config
    (progn
      (smex-initialize)
      (global-set-key (kbd "M-x") 'smex)
      (global-set-key (kbd "M-X") 'smex-major-mode-commands)))
#+END_SRC

* Editing
** Comment line or region
function to comment line or selected region
#+BEGIN_SRC emacs-lisp
(defun comment-line-or-region (n)
  "Comment or uncomment current line and leave point after it.
With positive prefix, apply to N lines including current one.
With negative prefix, apply to -N lines above.
If region is active, apply to active region instead."
  (interactive "p")
  (if (use-region-p)
      (comment-or-uncomment-region
       (region-beginning) (region-end))
    (let ((range
           (list (line-beginning-position)
                 (goto-char (line-end-position n)))))
      (comment-or-uncomment-region
       (apply #'min range)
       (apply #'max range)))
    (forward-line 1)
    (back-to-indentation)))
#+END_SRC

binding a suggestive command
#+BEGIN_SRC emacs-lisp
(global-set-key (kbd "C-;")
                'comment-line-or-region)
#+END_SRC

** Expand Region
let's try the simplest thing
#+BEGIN_SRC emacs-lisp
(use-package expand-region
  :ensure t
  :bind(("M-@" . er/expand-region)))
#+END_SRC

** Text Wrappers
Copying from [[https://github.com/howardabrams/dot-files/blob/master/emacs.org#block-wrappers][Howard Abrams]] again
#+BEGIN_SRC emacs-lisp
(use-package wrap-region
  :ensure   t
  :config
  (wrap-region-global-mode t)
  (wrap-region-add-wrappers
   '(("(" ")")
     ("[" "]")
     ("{" "}")
     ("<" ">")
     ("'" "'")
     ("\"" "\"")
     ("‘" "’"   "q")
     ("“" "”"   "Q")
     ("*" "*"   "b"   org-mode)                 ; bolden
     ("*" "*"   "*"   org-mode)                 ; bolden
     ("/" "/"   "i"   org-mode)                 ; italics
     ("/" "/"   "/"   org-mode)                 ; italics
     ("~" "~"   "c"   org-mode)                 ; code
     ("~" "~"   "~"   org-mode)                 ; code
     ("=" "="   "v"   org-mode)                 ; verbatim
     ("=" "="   "="   org-mode)                 ; verbatim
     ("_" "_"   "u" '(org-mode markdown-mode))  ; underline
     ("**" "**" "b"   markdown-mode)            ; bolden
     ("*" "*"   "i"   markdown-mode)            ; italics
     ("`" "`"   "c" '(markdown-mode ruby-mode)) ; code
     ("`" "'"   "c"   lisp-mode)                ; code
     ))
  :diminish wrap-region-mode)
#+END_SRC
He also does something that seems useful for org mode blocks, but I try just as it is now for a while.

** Suggestions and Completions

*** Company
    company seems a better package than auto-complete overall
#+BEGIN_SRC emacs-lisp
(use-package company
  :ensure t
  :init (setq company-require-match 'never)
  :bind ("C-|" . company-complete)
  :config
  (add-hook 'after-init-hook 'global-company-mode))
#+END_SRC

*** Auto-complete
#+BEGIN_SRC emacs-lisp :tangle no
(use-package auto-complete
  :disabled t
  :ensure t
  :config
  (progn
    (ac-config-default)))
#+END_SRC

** TODO Avy

** TODO Highlighting and Narrowing

** Flycheck
#+BEGIN_SRC emacs-lisp
(use-package flycheck
  :ensure t
  :init
  (add-hook 'after-init-hook 'global-flycheck-mode)
  :diminish "FC"
  :config
  (setq-default flycheck-disabled-checkers '(emacs-lisp-checkdoc)))
#+END_SRC

** TODO Calc
calc is awesome. i have to learn it and make a good configuration to write my papers.

** TODO Undo-tree

* Magit
I'll start by copying from [[https://github.com/howardabrams/dot-files/blob/master/emacs.org][howardabrams configuration]]
#+BEGIN_SRC emacs-lisp
(use-package magit
  :ensure t
  :commands magit-status magit-blame
  :init
  (defadvice magit-status (around magit-fullscreen activate)
    (window-configuration-to-register :magit-fullscreen)
    ad-do-it
    (delete-other-windows))
  :config
  (setq magit-branch-arguments nil
        ;; use ido to look for branches
        magit-completing-read-function 'magit-ido-completing-read
        ;; don't put "origin-" in front of new branch names by default
        magit-default-tracking-name-function 'magit-default-tracking-name-branch-only
        magit-push-always-verify nil
        ;; Get rid of the previous advice to go into fullscreen
        magit-restore-window-configuration t)
  :bind ("C-x g" . magit-status))
#+END_SRC

** TODO Fix the ido error that I get everytime I use magit

* Smartparens
automatically matches delimiters
#+BEGIN_SRC emacs-lisp
(use-package smartparens
  :ensure t
  :diminish smartparens-mode
  :config
  (progn
    (setq sp-highlight-pair-overlay nil)
    (show-smartparens-global-mode t)
    (smartparens-global-mode t)))
#+END_SRC

* Transpose-frame
not sure why i used this...
#+BEGIN_SRC emacs-lisp :tangle no
(use-package transpose-frame
  :ensure t
  :config
  (progn
    (global-set-key (kbd "M-Z") 'flop-frame)))
#+END_SRC

* Languages [2/7]

