emacs/.emacs.d/settings.org
** DONE Racket-mode
#+BEGIN_SRC emacs-lisp
(use-package rainbow-delimiters
  :ensure t)
(use-package racket-mode
  :ensure t
  :config
  (progn
    (add-to-list 'auto-mode-alist '("\\.rkt\\'" . racket-mode))
    (add-hook 'racket-mode-hook 'rainbow-delimiters-mode)
    (add-hook 'racket-mode-hook #'racket-unicode-input-method-enable)
    (add-hook 'racket-repl-mode-hook #'racket-unicode-input-method-enable)))
#+END_SRC

** DONE Python mode

*** Basic setup
#+BEGIN_SRC emacs-lisp
  (use-package python
    :mode ("\\.py\\'" . python-mode)
    :interpreter ("python" . python-mode)
    :init
    (setq-default indent-tabs-mode nil)
    :config
    (setq python-indent 4)
    (add-hook 'python-mode-hook 'color-identifiers-mode))
    ;;(highlight-indentation-mode -1))
#+END_SRC

*** Elpy
#+BEGIN_SRC emacs-lisp
(use-package elpy
  :ensure t
  :commands elpy-enable
  :init (with-eval-after-load 'python (elpy-enable))

  :config
  (progn
    (elpy-use-ipython)
    ; use flycheck not flymake with elpy
    (when (require 'flycheck nil t)
      (setq elpy-modules (delq 'elpy-module-flymake elpy-modules))
      (add-hook 'elpy-mode-hook 'flycheck-mode))))
#+END_SRC

*** live-py-mode
#+BEGIN_SRC emacs-lisp
(use-package live-py-mode
  :ensure t)
#+END_SRC
** Fish mode
#+BEGIN_SRC emacs-lisp
(use-package fish-mode
  :ensure t
  :config
  (add-to-list 'auto-mode-alist '("\\.fish\\'" . fish-mode)))
#+END_SRC
** TODO Julia-mode [0/1]
#+BEGIN_SRC emacs-lisp
(use-package julia-mode
  :ensure t)

(use-package julia-shell
  :ensure t)
#+END_SRC

*** TODO ESS
#+BEGIN_SRC emacs-lisp
(use-package ess
  :ensure t
  :defer t
  :init (setq inferior-julia-program-name "/home/felippe/.local/bin/julia"))
#+END_SRC

** TODO Hy-mode
#+BEGIN_SRC emacs-lisp
(use-package hy-mode
  :ensure t)
#+END_SRC

** TODO Haskell
#+BEGIN_SRC emacs-lisp
(use-package haskell-mode
  :ensure t
  :config
  (progn
    (add-to-list 'auto-mode-alist '("\\.hs\\'" . haskell-mode))
    (add-hook 'haskell-mode-hook 'haskell-indent-mode)
    (add-hook 'haskell-mode-hook 'interactive-haskell-mode)
    (add-hook 'haskell-mode-hook 'haskell-doc-mode)))
#+END_SRC
** TODO APL
** TODO Ledger
   #+BEGIN_SRC emacs-lisp :tangle no
   (use-package ledger-mode
     :ensure t
     :config
     (progn
       (add-to-list 'auto-mode-alist '("\\.ledger$" . ledger-mode))))
   #+END_SRC
* TODO Code Snippets [1/2]

** DONE Yasnippet
Need to add good snippets to use org mode
#+BEGIN_SRC emacs-lisp
(use-package yasnippet
  :ensure t
  :defer t
  :config 'yas-global-mode 1)
#+END_SRC
It is possible to use as a minor mode hooked to specific languages by, for example, replacing the above with
#+BEGIN_SRC emacs-lisp :tangle no
(use-package yasnippet
  :ensure t
  :defer t
  :config
  (progn
    (yas-reload-all)
    (add-hook 'python-mode #'yas-minor-mode)))
#+END_SRC

** TODO Language Snippets [0/9]

*** TODO Python

*** TODO Julia

*** TODO Racket

*** TODO Haskell

*** TODO Apl

*** TODO Emacs Lisp

*** TODO Org Mode

*** TODO LaTeX

*** TODO Other

* Searches
regex searches by default
#+BEGIN_SRC emacs-lisp :tangle no
(global-set-key (kbd "C-s") 'isearch-forward-regexp)
(global-set-key (kbd "C-r") 'isearch-backward-regexp)
(global-set-key (kbd "C-M-s") 'isearch-forward)
(global-set-key (kbd "C-M-r") 'isearch-backward)
#+END_SRC

activate occur mode inside isearch
#+BEGIN_SRC emacs-lisp
(define-key isearch-mode-map (kbd "C-o")
  (lambda () (interactive)
    (let ((case-fold-search isearch-case-fold-search))
      (occur (if isearch-regexp
                 isearch-string
               (regexp-quote isearch-string))))))
#+END_SRC

use hippie-expand with =M-/=
#+BEGIN_SRC emacs-lisp
(global-set-key (kbd "M-/") 'hippie-expand)
#+END_SRC

** TODO re-builder

* Org-mode

#+BEGIN_SRC emacs-lisp
(use-package ox-reveal
:ensure ox-reveal)

(setq org-reveal-root "http://cdn.jsdelivr.net/reveal.js/3.0.0/")
(setq org-reveal-mathjax t)

(use-package htmlize
:ensure t)
#+END_SRC
typical bindings
#+BEGIN_SRC emacs-lisp
(global-set-key "\C-cl" 'org-store-link)
(global-set-key "\C-ca" 'org-agenda)
(global-set-key "\C-cc" 'org-capture)
(global-set-key "\C-cb" 'org-iswitchb)
#+END_SRC

** some eye-candy
#+BEGIN_SRC emacs-lisp
  (use-package org-bullets
    :ensure t
    :config
    (add-hook 'org-mode-hook (lambda () (org-bullets-mode 1))))

  ;; (use-package org-beautify-theme
  ;;   :ensure t)
#+END_SRC

** Editing code within org-mode
better for editing source code
#+BEGIN_SRC emacs-lisp
(setq org-src-fontify-natively t
      org-src-preserve-indentation t
      org-list-allow-alphabetical t
      org-completion-use-ido t)
#+END_SRC

inline display of linked file images
#+BEGIN_SRC emacs-lisp
(add-hook 'org-babel-after-execute-hook 'org-display-inline-images 'append)
#+END_SRC

** don't ask if i really want to run the code
i want to run the code
#+BEGIN_SRC emacs-lisp
(setq org-confirm-babel-evaluate nil
      org-confirm-elisp-link-function nil
      org-confirm-shell-link-function nil)
#+END_SRC

** some language support
ob-ipython to make emacs emulate ipython notebooks
#+BEGIN_SRC emacs-lisp
  (use-package ob-ipython
    :ensure t)
#+END_SRC

loading some laguages to work with org
#+BEGIN_SRC emacs-lisp
  (org-babel-do-load-languages
   'org-babel-load-languages
   '((emacs-lisp . t)
     (sh . t)
     (python . t)
     (org . t)))
#+END_SRC

** TODO Org-ref
Just to have it running. Still need to configure the variables and keybidings.
#+BEGIN_SRC emacs-lisp
(use-package org-ref
  :ensure t)
#+END_SRC

* Functions and Macros
** TODO Persp-mode or eyebrowse to replace the stupidity below
*** A basic 3-windows setup macro
this one creates makes 3 windows with format
where the one in the left still in the buffer you called the macro and the ones at the right
run a eshell and a dired.
#+BEGIN_SRC emacs-lisp
(fset 'typical-window-session
      (lambda (&optional arg) "Keyboard macro." (interactive "p") (kmacro-exec-ring-item (quote ([24 51 134217959 24 50 134217848 101 115 104 101 108 108 13 134217959 100 24 6 6 13 134217959 97] 0 "%d")) arg)))
(global-set-key (kbd "M-z") 'typical-window-session)
(fset 'create-3-windows-session
   (lambda (&optional arg) "Keyboard macro." (interactive "p") (kmacro-exec-ring-item (quote ([134217767 97 67108911 24 51 134217767 115 67108911 134217848 101 115 104 101 108 108 return 24 50 134217767 100 24 6 6 return 134217767 97] 0 "%d")) arg)))
(global-set-key (kbd "M-z") 'create-3-windows-session)
#+END_SRC
