emacs/.emacs.d/settings.el

(use-package rainbow-delimiters
  :ensure t)
(use-package racket-mode
  :ensure t
  :config
  (progn
    (add-to-list 'auto-mode-alist '("\\.rkt\\'" . racket-mode))
    (add-hook 'racket-mode-hook 'rainbow-delimiters-mode)
    (add-hook 'racket-mode-hook #'racket-unicode-input-method-enable)
    (add-hook 'racket-repl-mode-hook #'racket-unicode-input-method-enable)))

(use-package python
  :mode ("\\.py\\'" . python-mode)
  :interpreter ("python" . python-mode)
  :init
  (setq-default indent-tabs-mode nil)
  :config
  (setq python-indent 4)
  (add-hook 'python-mode-hook 'color-identifiers-mode))
  ;;(highlight-indentation-mode -1))

(use-package elpy
  :ensure t
  :commands elpy-enable
  :init (with-eval-after-load 'python (elpy-enable))

  :config
  (progn
    (elpy-use-ipython)
    ; use flycheck not flymake with elpy
    (when (require 'flycheck nil t)
      (setq elpy-modules (delq 'elpy-module-flymake elpy-modules))
      (add-hook 'elpy-mode-hook 'flycheck-mode))))

(use-package live-py-mode
  :ensure t)

(use-package fish-mode
  :ensure t
  :config
  (add-to-list 'auto-mode-alist '("\\.fish\\'" . fish-mode)))

(use-package julia-mode
  :ensure t)

(use-package julia-shell
  :ensure t)

(use-package ess
  :ensure t
  :defer t
  :init (setq inferior-julia-program-name "/home/felippe/.local/bin/julia"))

(use-package hy-mode
  :ensure t)

(use-package haskell-mode
  :ensure t
  :config
  (progn
    (add-to-list 'auto-mode-alist '("\\.hs\\'" . haskell-mode))
    (add-hook 'haskell-mode-hook 'haskell-indent-mode)
    (add-hook 'haskell-mode-hook 'interactive-haskell-mode)
    (add-hook 'haskell-mode-hook 'haskell-doc-mode)))

(use-package yasnippet
  :ensure t
  :defer t
  :config 'yas-global-mode 1)

(define-key isearch-mode-map (kbd "C-o")
  (lambda () (interactive)
    (let ((case-fold-search isearch-case-fold-search))
      (occur (if isearch-regexp
                 isearch-string
               (regexp-quote isearch-string))))))

(global-set-key (kbd "M-/") 'hippie-expand)

(use-package ox-reveal
:ensure ox-reveal)

(setq org-reveal-root "http://cdn.jsdelivr.net/reveal.js/3.0.0/")
(setq org-reveal-mathjax t)

(use-package htmlize
:ensure t)

(global-set-key "\C-cl" 'org-store-link)
(global-set-key "\C-ca" 'org-agenda)
(global-set-key "\C-cc" 'org-capture)
(global-set-key "\C-cb" 'org-iswitchb)

(use-package org-bullets
  :ensure t
  :config
  (add-hook 'org-mode-hook (lambda () (org-bullets-mode 1))))

;; (use-package org-beautify-theme
;;   :ensure t)

(setq org-src-fontify-natively t
      org-src-preserve-indentation t
      org-list-allow-alphabetical t
      org-completion-use-ido t)

(add-hook 'org-babel-after-execute-hook 'org-display-inline-images 'append)

(setq org-confirm-babel-evaluate nil
      org-confirm-elisp-link-function nil
      org-confirm-shell-link-function nil)

(use-package ob-ipython
  :ensure t)

(org-babel-do-load-languages
 'org-babel-load-languages
 '((emacs-lisp . t)
   (sh . t)
   (python . t)
   (org . t)))

(use-package org-ref
  :ensure t)

(fset 'typical-window-session
      (lambda (&optional arg) "Keyboard macro." (interactive "p") (kmacro-exec-ring-item (quote ([24 51 134217959 24 50 134217848 101 115 104 101 108 108 13 134217959 100 24 6 6 13 134217959 97] 0 "%d")) arg)))
(global-set-key (kbd "M-z") 'typical-window-session)
(fset 'create-3-windows-session
   (lambda (&optional arg) "Keyboard macro." (interactive "p") (kmacro-exec-ring-item (quote ([134217767 97 67108911 24 51 134217767 115 67108911 134217848 101 115 104 101 108 108 return 24 50 134217767 100 24 6 6 return 134217767 97] 0 "%d")) arg)))
(global-set-key (kbd "M-z") 'create-3-windows-session)
